; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	image1 - mode
	thermograph0 - mode
	Star7 - direction
	Star0 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	Star2 - direction
	GroundStation1 - direction
	Star3 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 image1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star3)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star7)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star0)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 Star4)
	(supports instrument8 image1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 Star6)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star3)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon9)
)
(:goal (and
	(pointing satellite1 Star3)
	(pointing satellite2 Planet17)
	(pointing satellite4 GroundStation5)
	(have_image Star8 image1)
	(have_image Phenomenon9 thermograph0)
	(have_image Star10 thermograph0)
	(have_image Star11 thermograph0)
	(have_image Phenomenon12 thermograph0)
	(have_image Star13 image1)
	(have_image Planet14 thermograph0)
	(have_image Planet15 image1)
	(have_image Star16 image1)
	(have_image Planet17 thermograph0)
))

)

; plan
1. (turn_to satellite2 groundstation5 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 13
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 13
3. (calibrate satellite2 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 0 of 13
4. (turn_to satellite2 star10 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 star10)
   goals met: 0 of 13
5. (take_image satellite2 star10 instrument4 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 1 of 13
6. (turn_to satellite2 planet15 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet15)
   goals met: 1 of 13
7. (take_image satellite2 planet15 instrument4 image1)
   added: (have_image planet15 image1)
   goals met: 2 of 13
8. (turn_to satellite2 planet14 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet14)
   goals met: 2 of 13
9. (take_image satellite2 planet14 instrument4 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 3 of 13
10. (turn_to satellite2 phenomenon9 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 phenomenon9)
   goals met: 3 of 13
11. (take_image satellite2 phenomenon9 instrument4 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 4 of 13
12. (turn_to satellite2 phenomenon12 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon12)
   goals met: 4 of 13
13. (turn_to satellite1 star3 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star3)
   goals met: 5 of 13
14. (take_image satellite2 phenomenon12 instrument4 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 6 of 13
15. (turn_to satellite2 star11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star11)
   goals met: 6 of 13
16. (take_image satellite2 star11 instrument4 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 7 of 13
17. (turn_to satellite2 star13 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star13)
   goals met: 7 of 13
18. (take_image satellite2 star13 instrument4 image1)
   added: (have_image star13 image1)
   goals met: 8 of 13
19. (turn_to satellite2 star16 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star16)
   goals met: 8 of 13
20. (take_image satellite2 star16 instrument4 image1)
   added: (have_image star16 image1)
   goals met: 9 of 13
21. (turn_to satellite2 star8 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star8)
   goals met: 9 of 13
22. (take_image satellite2 star8 instrument4 image1)
   added: (have_image star8 image1)
   goals met: 10 of 13
23. (turn_to satellite2 planet17 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 planet17)
   goals met: 11 of 13
24. (take_image satellite2 planet17 instrument4 thermograph0)
   added: (have_image planet17 thermograph0)
   goals met: 12 of 13
25. (turn_to satellite4 groundstation5 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 groundstation5)
   goals met: 13 of 13
